In [1]:
import pandas as pd
from io import StringIO
csv_data = '''A,B,C,D
 1.0,2.0,3.0,4.0
5.0,6.0,,8.0
0.0,11.0,12.0,'''

In [2]:
df = pd.read_csv(StringIO(csv_data))
df

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [4]:
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

In [13]:
df.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [ 0., 11., 12., nan]])

In [10]:
df.dropna(axis=1)  ## need to assign it to some value

     A     B
0  1.0   2.0
1  5.0   6.0
2  0.0  11.0

In [14]:
df1=df.dropna(how='all')  ## where all columns and rows are null -- no such column where all is null hence nothing gets deleted

In [15]:
df1  ## nothing gets deleted as in this dataframe not a single record is empty

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [19]:
df2= df.dropna(thresh=3)  ## 4 column dataframe

In [21]:
df2

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [23]:
df2= df.dropna(subset=['C'])  ## row 3 has one record having NA , entire record gets deleted
df2

     A     B     C    D
0  1.0   2.0   3.0  4.0
2  0.0  11.0  12.0  NaN

In [24]:
## imputing missing values as in removing features/records loosing valueable information
from sklearn.preprocessing import Imputer
imr= Imputer(missing_values= 'NaN', strategy = 'mean' , axis =0 )  ## column mean other methods median and most_frequent
imr = imr.fit(df)
imputed_data = imr.transform(df.values)
imputed_data

array([[ 1. ,  2. ,  3. ,  4. ],
       [ 5. ,  6. ,  7.5,  8. ],
       [ 0. , 11. , 12. ,  6. ]])